# CreateDesignLayerPullDownMenu

## Description
Creates a Layout Manager design layer pull down menu control.

```pascal
PROCEDURE CreateDesignLayerPullDownMenu(
				nDialogID     : LONGINT;
				nComponentID  : LONGINT;
				nWidthInChars : INTEGER);
```

```python
def vs.CreateDesignLayerPullDownMenu(nDialogID, nComponentID, nWidthInChars):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|nDialogID|LONGINT|   |
|nComponentID|LONGINT|   |
|nWidthInChars|INTEGER|   |

## Version
Availability: from VectorWorks13.0

## Category
* Dialogs - Modern